Config/Catalogs/ВидыРегистровУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыРегистровУчета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКомандыПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/ВидыРегистровУчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ОбновитьВидыРегистровУчета");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

Функция ПолучитьВидРегистраБухгалтерскогоУчетаДляОтчета(ПолноеИмяОбъектаМетаданных,
	КлючВарианта, Наименование = "") Экспорт
	
	ИдентификаторОтчета = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПолноеИмяОбъектаМетаданных);
	
	ВариантОтчета = ВариантыОтчетов.ВариантОтчета(ИдентификаторОтчета, КлючВарианта);
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Отчет", ИдентификаторОтчета);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыРегистровУчета.Ссылка
	|ИЗ
	|	Справочник.ВидыРегистровУчета КАК ВидыРегистровУчета
	|ГДЕ
	|	ВидыРегистровУчета.Отчет = &Отчет";
	
	Если Не ВариантОтчета = Неопределено Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ВидыРегистровУчета.ВариантОтчета = &ВариантОтчета
		|";
		
		Запрос.Параметры.Вставить("ВариантОтчета", ВариантОтчета);
		
	КонецЕсли;
	
	Если Не Наименование = "" Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ВидыРегистровУчета.Наименование = &Наименование
		|";
		
		Запрос.Параметры.Вставить("Наименование", Наименование);
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	НовыйВидРегистра = Справочники.ВидыРегистровУчета.СоздатьЭлемент();
	НовыйВидРегистра.Отчет = ИдентификаторОтчета;
	НовыйВидРегистра.ВариантОтчета = ВариантОтчета;
	НовыйВидРегистра.Наименование = ?(ЗначениеЗаполнено(Наименование), Наименование,
		?(ЗначениеЗаполнено(НовыйВидРегистра.ВариантОтчета),
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВариантОтчета, "Наименование"),
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИдентификаторОтчета, "Наименование")));
	
	НовыйВидРегистра.Записать();
	
	Возврат НовыйВидРегистра.Ссылка;
	
КонецФункции

Функция ПолучитьВидРегистраБухгалтерскогоУчетаДляПечатнойФормы(ПолноеИмяОбъектаМетаданных,
	ИдентификаторКомандыПечати, Наименование = "") Экспорт
	
	ИдентификаторОтчета = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПолноеИмяОбъектаМетаданных);
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Отчет", ИдентификаторОтчета);
	Запрос.Параметры.Вставить("ИдентификаторКомандыПечати", ИдентификаторКомандыПечати);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыРегистровУчета.Ссылка
	|ИЗ
	|	Справочник.ВидыРегистровУчета КАК ВидыРегистровУчета
	|ГДЕ
	|	ВидыРегистровУчета.Отчет = &Отчет
	|	И ВидыРегистровУчета.ИдентификаторКомандыПечати = &ИдентификаторКомандыПечати
	|";
	
	Если Не Наименование = "" Тогда
		
		Запрос.Текст = Запрос.Текст + "
		|	И ВидыРегистровУчета.Наименование = &Наименование
		|";
		
		Запрос.Параметры.Вставить("Наименование", Наименование);
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	НовыйВидРегистра = Справочники.ВидыРегистровУчета.СоздатьЭлемент();
	НовыйВидРегистра.Отчет = ИдентификаторОтчета;
	НовыйВидРегистра.ИдентификаторКомандыПечати = ИдентификаторКомандыПечати;
	НовыйВидРегистра.Наименование = ?(ЗначениеЗаполнено(Наименование), Наименование,
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИдентификаторОтчета, "Наименование"));
	
	НовыйВидРегистра.Записать();
	
	Возврат НовыйВидРегистра.Ссылка;
	
КонецФункции

//Процедура выполняет заполнение справочника видов регистров учета
Процедура ОбновитьВидыРегистровУчета(ПараметрОбработчика = Неопределено) Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда // В подчиненных узлах РИБ не выполняется
		Возврат;
	КонецЕсли;
	
	ОтчетыРегистрыУчета = Новый Соответствие;
	
	Для Каждого ОбъектМетаданных Из Метаданные.Отчеты Цикл
		
		ИмяОтчета = ОбъектМетаданных.Имя;
		
		Попытка
			Если НЕ Отчеты[ИмяОтчета].ЭтоРегистрУчета() Тогда
				Продолжить;
			КонецЕсли;
		Исключение
			Продолжить;
		КонецПопытки;
		
		ИдентификаторОтчета = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ОбъектМетаданных.ПолноеИмя());
		
		ОтчетыРегистрыУчета.Вставить(ИдентификаторОтчета, Истина);
		
	КонецЦикла;
	
	ОтчетыИВарианты = Новый ТаблицаЗначений;
	ОтчетыИВарианты.Колонки.Добавить("Отчет", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыОбъектовМетаданных"));
	ОтчетыИВарианты.Колонки.Добавить("ВариантОтчета", Новый ОписаниеТипов("СправочникСсылка.ВариантыОтчетов"));
	
	Для Каждого Вариант Из ВариантыОтчетов.ПредопределенныеВариантыОтчетов() Цикл
		Если НЕ Вариант.ЭтоВариант Тогда
			Продолжить;
		КонецЕсли;
		Если ОтчетыРегистрыУчета[Вариант.Отчет] = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОтчетИВариант = ОтчетыИВарианты.Добавить();
		ОтчетИВариант.Отчет = Вариант.Отчет;
		Если НЕ ПустаяСтрока(Вариант.КлючВарианта) Тогда
			ОтчетИВариант.ВариантОтчета = ВариантыОтчетов.ВариантОтчета(Вариант.Отчет, Вариант.КлючВарианта);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтчетыИВарианты.Отчет КАК Отчет,
	|	ОтчетыИВарианты.ВариантОтчета КАК ВариантОтчета
	|ПОМЕСТИТЬ ОтчетыИВарианты
	|ИЗ
	|	&ОтчетыИВариантыВнешняя КАК ОтчетыИВарианты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтчетыИВарианты.Отчет КАК Отчет,
	|	ОтчетыИВарианты.Отчет.Наименование КАК ОтчетНаименование,
	|	ОтчетыИВарианты.ВариантОтчета КАК ВариантОтчета,
	|	ОтчетыИВарианты.ВариантОтчета.Наименование КАК ВариантОтчетаНаименование
	|ИЗ
	|	ОтчетыИВарианты КАК ОтчетыИВарианты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыРегистровУчета КАК ВидыРегистровУчета
	|		ПО ОтчетыИВарианты.Отчет = ВидыРегистровУчета.Отчет
	|			И ОтчетыИВарианты.ВариантОтчета = ВидыРегистровУчета.ВариантОтчета
	|ГДЕ
	|	ВидыРегистровУчета.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ОтчетыИВариантыВнешняя", ОтчетыИВарианты);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// в режиме запуска, как обработчика обновления (*) выполняем только в монопольном режиме
	Если ПараметрОбработчика <> Неопределено И ПараметрОбработчика.МонопольныйРежим = Ложь Тогда
		// установим признак необходимости монопольного режима
		ПараметрОбработчика.МонопольныйРежим = Истина;
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовыйВидРегистра = Справочники.ВидыРегистровУчета.СоздатьЭлемент();
		НовыйВидРегистра.Отчет = Выборка.Отчет;
		НовыйВидРегистра.ВариантОтчета = Выборка.ВариантОтчета;
		НовыйВидРегистра.Наименование = ?(ЗначениеЗаполнено(НовыйВидРегистра.ВариантОтчета),
			Выборка.ВариантОтчетаНаименование, Выборка.ОтчетНаименование);
		
		НовыйВидРегистра.Записать();
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Регистры учета. Добавлен новый вид регистра учета'"),
			УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ВидыРегистровУчета, НовыйВидРегистра);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	Результат.Добавить("Отчет");
	Результат.Добавить("ВариантОтчета");
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
